import json

path_json = 'c:/Users/Maksym/Desktop/discordUA05/guilds_config.json'

fixed_roles = [
    'Ivent Manager', '[А] Адміністратор', '[А] Модератор', '[А] Молодший модератор',
    '[ЗГА] Заступник ГА', '[К] Куратор Нелегальних Організацій', '[К]Куратор державних Організацій',
    '[КА] Куратор Адміністрації', '[КМА] Куратор молодшої адміністрації', 'Івент-Менеджер',
    'Адміністратор', 'Адміністрація Серверу', 'Адміністрація серверу', 'Аудитор сервера',
    'Ведучий заходів (Discord)', 'ГА | Головний Адміністратор', 'ГС ДО', 'ГС МВС',
    'ГС МО', 'ГС Міністерств', 'ГС НО', 'ГС ЦС', 'Головний Адміністратор',
    'Головний Модератор (Discord)', 'ЗГС ДО', 'ЗГС МВС', 'ЗГС МО', 'ЗГС Міністерств',
    'ЗГС НО', 'ЗГС ЦС', 'ЗСУ', 'Заступник ГМ (Discord)', 'Заступник Головного Адміністратора',
    'К | Куратор Державних Організацій', 'К | Куратор Нелегалів', 'КА | Куратор Адміністрації',
    'КМА | Куратор молодшої Адміністрації', 'Керівництво проєкту', 'Команда проєкту',
    'Куратор Адміністрації', 'Куратор Держ', 'Куратор Держ.', 'Куратор Заходів',
    'Куратор Модерації (Discord)', 'Куратор Неоф', 'Куратор Організації', 'Куратор Скарг',
    'Куратор Слідкуючої Адміністрації', 'Куратор Структури', 'Куратор Сім\'ї',
    'Куратор структури', 'Модератор', 'Модератор (Discord)', 'Молодший Модератор',
    'НПУ м. Дніпро', 'НПУ м. Київ', 'НПУ м. Львів', 'СБУ м. Дніпро', 'СБУ м. Київ',
    'СБУ м. Львів', 'Слідкуючий', 'Слідкуючий Адміністрації', 'Слідкуючий МВП',
    'Слідкуючий МВС', 'Слідкуючий МО', 'Слідкуючий МОЗ', 'Слідкуючий Нелегальних організацій',
    'Слідкуючий Неоф', 'Спеціальний Адміністратор', 'Спеціальний модератор (Discord)',
    'Стажер (Discord)', 'Старший Адміністратор', 'Старший Модератор',
    'Старший Слідкуючий Нелегальних організацій', 'Старший адміністратор',
    'Старший модератор (Discord)', 'Старший Модератор (Discord)', 'ТСН', 'ТЦК та СП',
    'Технічний Адміністратор'
]

with open(path_json, 'r', encoding='utf-8') as f:
    config_data = json.load(f)

for gid in config_data:
    config_data[gid]['allowed_roles'] = sorted(list(set(fixed_roles)))

with open(path_json, 'w', encoding='utf-8') as f:
    json.dump(config_data, f, ensure_ascii=False, indent=4)
print('DONE_RADICAL')
